Revit 2026 API

# RebarHostCategory Enumeration

---

Rebar host category

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RebarHostCategory
```
```vb
Public Enumeration RebarHostCategory
```
```cpp
public enum class RebarHostCategory
```
```fsharp
type RebarHostCategory
```

| Member name | Value | Description |
| --- | --- | --- |
| Floor | 5 | Floor. |
| Other | 0 | Unknown or invalid host. |
| Part | 1 | Part. |
| SlabEdge | 8 | Slab Edge. |
| Stairs | 7 | Stairs. |
| StructuralColumn | 2 | Structural Column. |
| StructuralFoundation | 6 | Structural Foundation. |
| StructuralFraming | 3 | Structural Framing. |
| Wall | 4 | Wall. |

#### Reference

Autodesk.Revit.DB.Structure Namespace